from Organizations.GeneratePrice.Entities.CoeffMarkets import CoeffMarkets


class CoeffBuildMarket(CoeffMarkets):
    def __init__(self):
        super().__init__()

    def _init_positions(self) -> dict[str, dict[str, dict[str, float]]]:
        return {
            "construction": self.__construction_positions(),
            "renovation": self.__renovation_positions(),
            "garden": self.__garden_positions()
        }

    def __construction_positions(self) -> dict[str, dict[str, float]]:
        return {
            "Моё добро": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Домашний мастер": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Похорошела": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Строим ТУТ!": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Строимся": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Стройкино": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Молот и Наковальня": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Малахит": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Ремонтово": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Прекрасная квартира!": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "ЗаБей!": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Саморезкино": {"Гайка": 0.95, "Анкер": 0.95, "Молоток": 0.95, "Кусачки": 0.95, "Набор бит": 1.0},
            "Всё что нужно": {"Гайка": 1.0, "Анкер": 1.0, "Молоток": 1.0, "Кусачки": 1.0},
            "Стройся": {"Анкер": 1.05, "Молоток": 1.2, "Кусачки": 1.1, "Набор бит": 1.1},
            "Молотково": {"Гайка": 0.9, "Анкер": 0.9, "Молоток": 1.03},
            "ШкафоБаза": {"Молоток": 1.25, "Кусачки": 1.25, "Набор бит": 1.25, "Перфоратор": 1.25},
            "Luxary Renovation": {"Гайка": 1.1, "Анкер": 1.1, "Молоток": 1.05, "Кусачки": 1.05, "Набор бит": 1.05}
        }

    def __renovation_positions(self) -> dict[str, dict[str, float]]:
        return {
            "Моё добро": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Домашний мастер": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Похорошела": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Строим ТУТ!": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Строимся": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Стройкино": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Молот и Наковальня": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Малахит": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Ремонтово": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Прекрасная квартира!": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "ЗаБей!": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Саморезкино": {"Изолента": 0.95, "Скотч": 0.95, "Канцелярский нож": 0.95, "Отвертка": 0.95, "Шуруповерт": 0.95},
            "Всё что нужно": {"Изолента": 1.0, "Скотч": 1.0, "Канцелярский нож": 1.0, "Отвертка": 1.0},
            "Стройся": {"Скотч": 1.05, "Канцелярский нож": 1.05, "Отвертка": 1.05, "Шуруповерт": 1.05},
            "Молотково": {"Изолента": 0.8, "Скотч": 0.8, "Канцелярский нож": 0.8, "Отвертка": 0.8},
            "ШкафоБаза": {"Канцелярский нож": 1.2, "Отвертка": 1.2, "Шуруповерт": 1.2, "Дрель": 1.2},
            "Luxary Renovation": {"Изолента": 1.05, "Скотч": 1.05, "Канцелярский нож": 1.05, "Отвертка": 1.05, "Шуруповерт": 1.05}
        }

    def __garden_positions(self) -> dict[str, dict[str, float]]:
        return {
            "Моё добро": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Домашний мастер": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Похорошела": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Строим ТУТ!": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Строимся": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Стройкино": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Молот и Наковальня": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Малахит": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Ремонтово": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Прекрасная квартира!": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "ЗаБей!": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Саморезкино": {"Быстросъем": 0.95, "Гном": 0.95, "Шланг": 0.95, "Кресло": 0.95, "Стол": 0.95, "Качели": 0.95},
            "Всё что нужно": {"Быстросъем": 1.0, "Гном": 1.0, "Шланг": 1.0, "Кресло": 1.0, "Стол": 1.0, "Качели": 1.0},
            "Стройся": {"Быстросъем": 1.05, "Гном": 1.05, "Шланг": 1.05, "Кресло": 1.05, "Стол": 1.05, "Качели": 1.05},
            "Молотково": {"Быстросъем": 0.7, "Гном": 0.7, "Шланг": 0.7, "Кресло": 0.7, "Стол": 0.7, "Качели": 0.7},
            "ШкафоБаза": {"Быстросъем": 1.2, "Шланг": 1.2, "Кресло": 1.2, "Стол": 1.2, "Качели": 1.2},
            "Luxary Renovation": {"Быстросъем": 1.04, "Гном": 1.04, "Шланг": 1.04, "Кресло": 1.04, "Стол": 1.04}
        }
