from Organizations.GeneratePrice.Entities.CoeffMarkets import CoeffMarkets


class CoeffZooMarket(CoeffMarkets):
    def __init__(self):
        super().__init__()

    def _init_positions(self) -> dict[str, dict[str, dict[str, float]]]:
        return {
            "medicines": self.__medicines_positions(),
            "accessories": self.__accessories_positions(),
            "services": self.__services_positions()
        }

    def __medicines_positions(self) -> dict[str, dict[str, float]]:
        return {
            "Очень приятно, Плюша!": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Мой счастливый Котофей": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Бездомный Бобик": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Атака Мухтаров": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Мой сосед Василий": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "ХодячийZoo!": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Усы, лапы, хвост": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Восхождение героя лотка": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Мастера МЯУ Online": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Джунгли зовут!": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Коготь рассекающий крысу": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "Кот в сапогах": {"БлошекНет": 0.95, "Глистогон": 0.95, "ОтБлох": 0.95, "Кулакса": 0.95, "СинусКот": 1.0},
            "ВанПачКэт": {"БлошекНет": 1.0, "Глистогон": 1.0, "ОтБлох": 1.0, "Кулакса": 1.0},
            "Шаман Пэт": {"Глистогон": 1.05, "ОтБлох": 1.2, "Кулакса": 1.1, "СинусКот": 1.1},
            "Бобик в гостях у Барбоса": {"БлошекНет": 0.9, "Глистогон": 0.9, "ОтБлох": 1.03},
            "Унесённые лакомствами": {"ОтБлох": 1.25, "Кулакса": 1.25, "СинусКот": 1.25, "АмПет": 1.25},
            "Пэтангелион": {"БлошекНет": 1.1, "Глистогон": 1.1, "ОтБлох": 1.05, "Кулакса": 1.05, "СинусКот": 1.05}
        }

    def __accessories_positions(self) -> dict[str, dict[str, float]]:
        return {
            "Очень приятно, Плюша!": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Мой счастливый Котофей": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Бездомный Бобик": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Атака Мухтаров": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Мой сосед Василий": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "ХодячийZoo!": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Усы, лапы, хвост": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Восхождение героя лотка": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Мастера МЯУ Online": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Джунгли зовут!": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Коготь рассекающий крысу": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "Кот в сапогах": {"Мятный шарик": 0.95, "Брелок": 0.95, "Мышка": 0.95, "Мячик": 0.95, "Поводок": 0.95},
            "ВанПачКэт": {"Мятный шарик": 1.0, "Брелок": 1.0, "Мышка": 1.0, "Мячик": 1.0},
            "Шаман Пэт": {"Брелок": 1.05, "Мышка": 1.05, "Мячик": 1.05, "Поводок": 1.05},
            "Бобик в гостях у Барбоса": {"Мятный шарик": 0.8, "Брелок": 0.8, "Мышка": 0.8, "Мячик": 0.8},
            "Унесённые лакомствами": {"Мышка": 1.2, "Мячик": 1.2, "Поводок": 1.2, "Комбенизон": 1.2},
            "Пэтангелион": {"Мятный шарик": 1.05, "Брелок": 1.05, "Мышка": 1.05, "Мячик": 1.05, "Поводок": 1.05}
        }

    def __services_positions(self) -> dict[str, dict[str, float]]:
        return {
            "Очень приятно, Плюша!": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Мой счастливый Котофей": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Бездомный Бобик": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Атака Мухтаров": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Мой сосед Василий": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "ХодячийZoo!": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Усы, лапы, хвост": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Восхождение героя лотка": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Мастера МЯУ Online": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Джунгли зовут!": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Коготь рассекающий крысу": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "Кот в сапогах": {"Укол": 0.95, "Осмотр": 0.95, "Вакцинация": 0.95, "Кастрация": 0.95, "Стерилизация": 0.95, "Санация": 0.95},
            "ВанПачКэт": {"Укол": 1.0, "Осмотр": 1.0, "Вакцинация": 1.0, "Кастрация": 1.0, "Стерилизация": 1.0, "Санация": 1.0},
            "Шаман Пэт": {"Укол": 1.05, "Осмотр": 1.05, "Вакцинация": 1.05, "Кастрация": 1.05, "Стерилизация": 1.05, "Санация": 1.05},
            "Бобик в гостях у Барбоса": {"Укол": 0.7, "Осмотр": 0.7, "Вакцинация": 0.7, "Кастрация": 0.7, "Стерилизация": 0.7, "Санация": 0.7},
            "Унесённые лакомствами": {"Укол": 1.2, "Вакцинация": 1.2, "Кастрация": 1.2, "Стерилизация": 1.2, "Санация": 1.2},
            "Пэтангелион": {"Укол": 1.04, "Осмотр": 1.04, "Вакцинация": 1.04, "Кастрация": 1.04, "Стерилизация": 1.04}
        }
